{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "[CLS]": 4,
      "[SEP]": 5,
      "[MASK]": 6,
      "0": 7,
      "1": 8,
      "2": 9,
      "3": 10,
      "4": 11,
      "5": 12,
      "6": 13,
      "7": 14,
      "8": 15,
      "9": 16,
      "A": 17,
      "B": 18,
      "C": 19,
      "D": 20,
      "E": 21,
      "F": 22,
      "G": 23,
      "H": 24,
      "I": 25,
      "J": 26,
      "K": 27,
      "L": 28,
      "M": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "Q": 33,
      "R": 34,
      "S": 35,
      "T": 36,
      "U": 37,
      "V": 38,
      "W": 39,
      "X": 40,
      "Y": 41,
      "Z": 42,
      "▁": 43,
      "▁P": 44,
      "SH": 45,
      "USH": 46,
      "▁PUSH": 47,
      "▁D": 48,
      "UP": 49,
      "▁DUP": 50,
      "▁S": 51,
      "▁PUSH1": 52,
      "AP": 53,
      "WAP": 54,
      "▁SWAP": 55,
      "AD": 56,
      "MP": 57,
      "JU": 58,
      "▁JU": 59,
      "▁JUMP": 60,
      "ST": 61,
      "▁PUSH2": 62,
      "▁M": 63,
      "▁SWAP1": 64,
      "▁DUP1": 65,
      "RE": 66,
      "OP": 67,
      "LO": 68,
      "▁DUP2": 69,
      "▁POP": 70,
      "LOAD": 71,
      "DE": 72,
      "DEST": 73,
      "▁JUMPDEST": 74,
      "ER": 75,
      "▁AD": 76,
      "▁ADD": 77,
      "ORE": 78,
      "STORE": 79,
      "▁MSTORE": 80,
      "▁SWAP2": 81,
      "ND": 82,
      "▁MLOAD": 83,
      "AND": 84,
      "▁AND": 85,
      "AL": 86,
      "IS": 87,
      "ZER": 88,
      "▁IS": 89,
      "ZERO": 90,
      "▁ISZERO": 91,
      "▁JUMPI": 92,
      "▁C": 93,
      "ALL": 94,
      "▁CALL": 95,
      "UB": 96,
      "▁SUB": 97,
      "▁DUP3": 98,
      "▁DUP4": 99,
      "▁E": 100,
      "▁RE": 101,
      "▁PUSH20": 102,
      "▁SLOAD": 103,
      "AT": 104,
      "ATA": 105,
      "VER": 106,
      "▁REVER": 107,
      "▁REVERT": 108,
      "▁EX": 109,
      "▁SWAP3": 110,
      "▁SH": 111,
      "▁PUSH4": 112,
      "▁EXP": 113,
      "A3": 114,
      "▁SHA3": 115,
      "DATA": 116,
      "▁CALLDATA": 117,
      "▁EQ": 118,
      "TU": 119,
      "▁RETU": 120,
      "▁RETUR": 121,
      "UE": 122,
      "VAL": 123,
      "▁CALLVAL": 124,
      "▁CALLVALUE": 125,
      "▁CALLDATALOAD": 126,
      "UL": 127,
      "▁MUL": 128,
      "▁DUP5": 129,
      "▁CALLER": 130,
      "IV": 131,
      "▁DIV": 132,
      "IZ": 133,
      "SIZ": 134,
      "SIZE": 135,
      "▁LO": 136,
      "▁LOG": 137,
      "▁SSTORE": 138,
      "▁DUP6": 139,
      "COP": 140,
      "COPY": 141,
      "LT": 142,
      "▁LT": 143,
      "▁RETURN": 144,
      "▁SWAP4": 145,
      "ODE": 146,
      "▁LOG3": 147,
      "▁PUSH3": 148,
      "▁G": 149,
      "NDATA": 150,
      "▁RETURNDATA": 151,
      "▁CODE": 152,
      "▁CODECOPY": 153,
      "SS": 154,
      "RESS": 155,
      "▁ADDRESS": 156,
      "▁PUSH32": 157,
      "▁GT": 158,
      "▁RETURNDATASIZE": 159,
      "▁DUP7": 160,
      "▁ST": 161,
      "▁STOP": 162,
      "▁DUP9": 163,
      "▁DUP8": 164,
      "▁N": 165,
      "▁CALLDATASIZE": 166,
      "OT": 167,
      "▁NOT": 168,
      "▁SWAP5": 169,
      "IM": 170,
      "AMP": 171,
      "EST": 172,
      "TIM": 173,
      "▁TIM": 174,
      "ESTAMP": 175,
      "▁TIMESTAMP": 176,
      "▁RETURNDATACOPY": 177,
      "OR": 178,
      "AS": 179,
      "▁OR": 180,
      "▁SHL": 181,
      "▁GAS": 182,
      "CODE": 183,
      "▁LOG1": 184,
      "TCODE": 185,
      "▁EXTCODE": 186,
      "▁EXTCODESIZE": 187,
      "▁SWAP6": 188,
      "▁PUSH29": 189,
      "▁PUSH9": 190,
      "▁PUSH6": 191,
      "▁B": 192,
      "CE": 193,
      "AN": 194,
      "ALAN": 195,
      "ALANCE": 196,
      "▁SWAP7": 197,
      "▁BALANCE": 198,
      "▁CALLDATACOPY": 199,
      "▁DUP10": 200,
      "▁LOG2": 201,
      "▁DUP11": 202,
      "▁PUSH8": 203,
      "ATE": 204,
      "▁DUP12": 205,
      "▁SWAP8": 206,
      "▁PUSH10": 207,
      "REATE": 208,
      "▁CREATE": 209,
      "EL": 210,
      "BER": 211,
      "MBER": 212,
      "UMBER": 213,
      "▁PUSH5": 214,
      "▁NUMBER": 215,
      "▁SWAP12": 216,
      "▁DUP13": 217,
      "▁PUSH21": 218,
      "▁SWAP11": 219,
      "IN": 220,
      "OD": 221,
      "▁PUSH7": 222,
      "▁SWAP9": 223,
      "▁CREATE2": 224,
      "HA": 225,
      "TE": 226,
      "▁SLT": 227,
      "▁DUP15": 228,
      "CALL": 229,
      "▁SEL": 230,
      "▁SELF": 231,
      "IG": 232,
      "YTE": 233,
      "▁DUP14": 234,
      "▁SHR": 235,
      "▁BYTE": 236,
      "HASH": 237,
      "MOD": 238,
      "▁PUSH22": 239,
      "▁SWAP10": 240,
      "▁ORIG": 241,
      "▁ORIGIN": 242,
      "▁PUSH13": 243,
      "▁CALLCODE": 244,
      "▁CODESIZE": 245,
      "EG": 246,
      "▁DEL": 247,
      "▁PUSH16": 248,
      "▁MSTORE8": 249,
      "ATECALL": 250,
      "EGATECALL": 251,
      "▁DELEGATECALL": 252,
      "BALANCE": 253,
      "CT": 254,
      "DIV": 255,
      "RU": 256,
      "▁SDIV": 257,
      "▁PUSH18": 258,
      "DESTRU": 259,
      "ASE": 260,
      "▁SELFBALANCE": 261,
      "▁SELFDESTRU": 262,
      "▁SELFDESTRUCT": 263,
      "CK": 264,
      "CCALL": 265,
      "ICCALL": 266,
      "▁MOD": 267,
      "LOCK": 268,
      "ATICCALL": 269,
      "▁STATICCALL": 270,
      "▁BLOCK": 271,
      "▁BLOCKHASH": 272,
      "▁PUSH11": 273,
      "▁PUSH25": 274,
      "▁EXTCODEHASH": 275,
      "GT": 276,
      "▁PC": 277,
      "▁SGT": 278,
      "▁PUSH15": 279,
      "▁PUSH17": 280,
      "▁PUSH19": 281,
      "▁MSIZE": 282,
      "▁SWAP14": 283,
      "▁DUP16": 284,
      "BASE": 285,
      "EX": 286,
      "ID": 287,
      "NEX": 288,
      "OIN": 289,
      "▁SIG": 290,
      "▁SMOD": 291,
      "▁SWAP13": 292,
      "▁CHA": 293,
      "▁COIN": 294,
      "▁MULMOD": 295,
      "INID": 296,
      "TEND": 297,
      "NEXTEND": 298,
      "▁SIGNEXTEND": 299,
      "▁CHAINID": 300,
      "▁COINBASE": 301,
      "EE": 302,
      "FEE": 303,
      "ICE": 304,
      "PR": 305,
      "XOR": 306,
      "▁XOR": 307,
      "▁PUSH12": 308,
      "▁SWAP15": 309,
      "▁SWAP16": 310,
      "▁ADDMOD": 311,
      "▁LOG4": 312,
      "▁GASPR": 313,
      "▁BASE": 314,
      "▁GASPRICE": 315,
      "▁BASEFEE": 316,
      "AR": 317,
      "IT": 318,
      "LIM": 319,
      "▁SAR": 320,
      "▁PUSH14": 321,
      "▁PUSH26": 322,
      "▁PUSH27": 323,
      "▁PUSH30": 324,
      "▁GASLIM": 325,
      "▁EXTCODECOPY": 326,
      "▁GASLIMIT": 327,
      "▁PUSH24": 328,
      "▁PUSH28": 329,
      "▁LOG0": 330,
      "▁PUSH31": 331
    },
    "merges": [
      "▁ P",
      "S H",
      "U SH",
      "▁P USH",
      "▁ D",
      "U P",
      "▁D UP",
      "▁ S",
      "▁PUSH 1",
      "A P",
      "W AP",
      "▁S WAP",
      "A D",
      "M P",
      "J U",
      "▁ JU",
      "▁JU MP",
      "S T",
      "▁PUSH 2",
      "▁ M",
      "▁SWAP 1",
      "▁DUP 1",
      "R E",
      "O P",
      "L O",
      "▁DUP 2",
      "▁P OP",
      "LO AD",
      "D E",
      "DE ST",
      "▁JUMP DEST",
      "E R",
      "▁ AD",
      "▁AD D",
      "O RE",
      "ST ORE",
      "▁M STORE",
      "▁SWAP 2",
      "N D",
      "▁M LOAD",
      "A ND",
      "▁ AND",
      "A L",
      "I S",
      "Z ER",
      "▁ IS",
      "ZER O",
      "▁IS ZERO",
      "▁JUMP I",
      "▁ C",
      "AL L",
      "▁C ALL",
      "U B",
      "▁S UB",
      "▁DUP 3",
      "▁DUP 4",
      "▁ E",
      "▁ RE",
      "▁PUSH2 0",
      "▁S LOAD",
      "A T",
      "AT A",
      "V ER",
      "▁RE VER",
      "▁REVER T",
      "▁E X",
      "▁SWAP 3",
      "▁ SH",
      "▁PUSH 4",
      "▁EX P",
      "A 3",
      "▁SH A3",
      "D ATA",
      "▁CALL DATA",
      "▁E Q",
      "T U",
      "▁RE TU",
      "▁RETU R",
      "U E",
      "V AL",
      "▁CALL VAL",
      "▁CALLVAL UE",
      "▁CALLDATA LOAD",
      "U L",
      "▁M UL",
      "▁DUP 5",
      "▁CALL ER",
      "I V",
      "▁D IV",
      "I Z",
      "S IZ",
      "SIZ E",
      "▁ LO",
      "▁LO G",
      "▁S STORE",
      "▁DUP 6",
      "C OP",
      "COP Y",
      "L T",
      "▁ LT",
      "▁RETUR N",
      "▁SWAP 4",
      "O DE",
      "▁LOG 3",
      "▁PUSH 3",
      "▁ G",
      "ND ATA",
      "▁RETUR NDATA",
      "▁C ODE",
      "▁CODE COPY",
      "S S",
      "RE SS",
      "▁ADD RESS",
      "▁PUSH3 2",
      "▁G T",
      "▁RETURNDATA SIZE",
      "▁DUP 7",
      "▁S T",
      "▁ST OP",
      "▁DUP 9",
      "▁DUP 8",
      "▁ N",
      "▁CALLDATA SIZE",
      "O T",
      "▁N OT",
      "▁SWAP 5",
      "I M",
      "A MP",
      "E ST",
      "T IM",
      "▁ TIM",
      "EST AMP",
      "▁TIM ESTAMP",
      "▁RETURNDATA COPY",
      "O R",
      "A S",
      "▁ OR",
      "▁SH L",
      "▁G AS",
      "C ODE",
      "▁LOG 1",
      "T CODE",
      "▁EX TCODE",
      "▁EXTCODE SIZE",
      "▁SWAP 6",
      "▁PUSH2 9",
      "▁PUSH 9",
      "▁PUSH 6",
      "▁ B",
      "C E",
      "A N",
      "AL AN",
      "ALAN CE",
      "▁SWAP 7",
      "▁B ALANCE",
      "▁CALLDATA COPY",
      "▁DUP1 0",
      "▁LOG 2",
      "▁DUP1 1",
      "▁PUSH 8",
      "AT E",
      "▁DUP1 2",
      "▁SWAP 8",
      "▁PUSH1 0",
      "RE ATE",
      "▁C REATE",
      "E L",
      "B ER",
      "M BER",
      "U MBER",
      "▁PUSH 5",
      "▁N UMBER",
      "▁SWAP1 2",
      "▁DUP1 3",
      "▁PUSH2 1",
      "▁SWAP1 1",
      "I N",
      "O D",
      "▁PUSH 7",
      "▁SWAP 9",
      "▁CREATE 2",
      "H A",
      "T E",
      "▁S LT",
      "▁DUP1 5",
      "C ALL",
      "▁S EL",
      "▁SEL F",
      "I G",
      "Y TE",
      "▁DUP1 4",
      "▁SH R",
      "▁B YTE",
      "HA SH",
      "M OD",
      "▁PUSH2 2",
      "▁SWAP1 0",
      "▁OR IG",
      "▁ORIG IN",
      "▁PUSH1 3",
      "▁CALL CODE",
      "▁CODE SIZE",
      "E G",
      "▁D EL",
      "▁PUSH1 6",
      "▁MSTORE 8",
      "ATE CALL",
      "EG ATECALL",
      "▁DEL EGATECALL",
      "B ALANCE",
      "C T",
      "D IV",
      "R U",
      "▁S DIV",
      "▁PUSH1 8",
      "DEST RU",
      "AS E",
      "▁SELF BALANCE",
      "▁SELF DESTRU",
      "▁SELFDESTRU CT",
      "C K",
      "C CALL",
      "I CCALL",
      "▁M OD",
      "LO CK",
      "AT ICCALL",
      "▁ST ATICCALL",
      "▁B LOCK",
      "▁BLOCK HASH",
      "▁PUSH1 1",
      "▁PUSH2 5",
      "▁EXTCODE HASH",
      "G T",
      "▁P C",
      "▁S GT",
      "▁PUSH1 5",
      "▁PUSH1 7",
      "▁PUSH1 9",
      "▁M SIZE",
      "▁SWAP1 4",
      "▁DUP1 6",
      "B ASE",
      "E X",
      "I D",
      "N EX",
      "O IN",
      "▁S IG",
      "▁S MOD",
      "▁SWAP1 3",
      "▁C HA",
      "▁C OIN",
      "▁MUL MOD",
      "IN ID",
      "TE ND",
      "NEX TEND",
      "▁SIG NEXTEND",
      "▁CHA INID",
      "▁COIN BASE",
      "E E",
      "F EE",
      "I CE",
      "P R",
      "X OR",
      "▁ XOR",
      "▁PUSH1 2",
      "▁SWAP1 5",
      "▁SWAP1 6",
      "▁ADD MOD",
      "▁LOG 4",
      "▁GAS PR",
      "▁B ASE",
      "▁GASPR ICE",
      "▁BASE FEE",
      "A R",
      "I T",
      "L IM",
      "▁S AR",
      "▁PUSH1 4",
      "▁PUSH2 6",
      "▁PUSH2 7",
      "▁PUSH3 0",
      "▁GAS LIM",
      "▁EXTCODE COPY",
      "▁GASLIM IT",
      "▁PUSH2 4",
      "▁PUSH2 8",
      "▁LOG 0",
      "▁PUSH3 1"
    ]
  }
}